#### Terraform Plan 📖

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.artifact_registry.google_artifact_registry_repository.dagster will be updated in-place
  ~ resource "google_artifact_registry_repository" "dagster" {
      ~ effective_labels       = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        id                     = "projects/olist-data-portal/locations/asia-northeast1/repositories/odp-dagster"
      ~ labels                 = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        name                   = "odp-dagster"
      ~ terraform_labels       = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        # (9 unchanged attributes hidden)
    }

  # module.cloudsql.data.google_secret_manager_secret_version.database_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "database_password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "odp-database-password"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.main will be updated in-place
  ~ resource "google_sql_database_instance" "main" {
        id                             = "odp-cloudsql"
        name                           = "odp-cloudsql"
        # (14 unchanged attributes hidden)

      ~ settings {
          ~ user_labels                  = {
              + "environment" = "prd"
              + "managed-by"  = "terraform"
              + "project"     = "odp"
            }
            # (14 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }
    }

  # module.cloudsql.google_sql_user.user will be updated in-place
  ~ resource "google_sql_user" "user" {
        id                      = "dagster//odp-cloudsql"
        name                    = "dagster"
      ~ password                = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.gcs.google_storage_bucket.data_lake will be updated in-place
  ~ resource "google_storage_bucket" "data_lake" {
      ~ effective_labels            = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        id                          = "odp-data-lake"
      ~ labels                      = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        name                        = "odp-data-lake"
      ~ terraform_labels            = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                                       = "projects/olist-data-portal/locations/asia-northeast1/clusters/odp-dagster-cluster"
        name                                     = "odp-dagster-cluster"
      ~ resource_labels                          = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        # (28 unchanged attributes hidden)

      ~ master_authorized_networks_config {
            # (1 unchanged attribute hidden)

          - cidr_blocks {
              - cidr_block = "10.0.0.0/24" -> null
            }
          - cidr_blocks {
              - cidr_block = "125.194.8.190/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "13.64.0.0/11" -> null
            }
          - cidr_blocks {
              - cidr_block = "140.82.112.0/20" -> null
            }
          - cidr_blocks {
              - cidr_block = "143.55.64.0/20" -> null
            }
          - cidr_blocks {
              - cidr_block = "185.199.108.0/22" -> null
            }
          - cidr_blocks {
              - cidr_block = "192.30.252.0/22" -> null
            }
          - cidr_blocks {
              - cidr_block = "20.0.0.0/8" -> null
            }
          - cidr_blocks {
              - cidr_block = "4.0.0.0/8" -> null
            }
          - cidr_blocks {
              - cidr_block = "40.0.0.0/10" -> null
            }
          - cidr_blocks {
              - cidr_block = "52.0.0.0/14" -> null
            }
          - cidr_blocks {
              - cidr_block = "68.220.59.211/32" -> null
            }
          + cidr_blocks {
              + cidr_block   = "10.0.0.0/24"
              + display_name = "VPC Internal"
            }
          + cidr_blocks {
              + cidr_block   = "125.194.8.190/32"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "13.64.0.0/11"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "140.82.112.0/20"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "143.55.64.0/20"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "185.199.108.0/22"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "192.30.252.0/22"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "20.0.0.0/8"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "4.0.0.0/8"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "40.0.0.0/10"
              + display_name = "External Access"
            }
          + cidr_blocks {
              + cidr_block   = "52.0.0.0/14"
              + display_name = "External Access"
            }
        }

        # (32 unchanged blocks hidden)
    }

  # module.kubernetes.data.google_secret_manager_secret_version.database_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "database_password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "odp-database-password"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.kubernetes.kubernetes_secret.database_password will be updated in-place
  ~ resource "kubernetes_secret" "database_password" {
      ~ data                           = (sensitive value)
        id                             = "odp-dagster/odp-database-password"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes.kubernetes_service.user_code will be updated in-place
  ~ resource "kubernetes_service" "user_code" {
        id                     = "odp-dagster/odp-dagster-user-code"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "odp-dagster-user-code"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes.kubernetes_service.webserver will be updated in-place
  ~ resource "kubernetes_service" "webserver" {
        id                     = "odp-dagster/odp-dagster-webserver"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg-status" = jsonencode(
                    {
                      - network_endpoint_groups = {
                          - "3000" = "k8s1-7e11c5df-odp-dagster-odp-dagster-webserver-3000-160a322e"
                        }
                      - zones                   = [
                          - "asia-northeast1-b",
                          - "asia-northeast1-c",
                        ]
                    }
                ) -> null
                # (1 unchanged element hidden)
            }
            name             = "odp-dagster-webserver"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ selector                          = {
              ~ "app" = "dagster-web" -> "dagster-webserver"
            }
            # (13 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.secret_manager.google_secret_manager_secret.database_password will be updated in-place
  ~ resource "google_secret_manager_secret" "database_password" {
      ~ effective_labels      = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        id                    = "projects/olist-data-portal/secrets/odp-database-password"
      ~ labels                = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        name                  = "projects/677014132196/secrets/odp-database-password"
      ~ terraform_labels      = {
          + "environment" = "prd"
          + "managed-by"  = "terraform"
          + "project"     = "odp"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.secret_manager.random_password.database_password will be updated in-place
  ~ resource "random_password" "database_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

Plan: 0 to add, 10 to change, 0 to destroy.

```

*Pusher: @9714, Action: `pull_request`*